EDT/УТ/src/Catalogs/РегиональныеТерминалы/РегиональныеТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегиональныеТерминалы</name>
  <predefined>
    <items>
      <name>МоскваСтриж</name>
      <description>Москва Стриж</description>
    </items>
    <items>
      <name>СПбСтриж</name>
      <description>СПб Стриж</description>
    </items>
  </predefined>
  <attributes>
    <name>КодТерминала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Самовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическаяЗонаДоставки</name>
    <type>
      <types>CatalogRef.новаРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗакрытияОперДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеглЗаданиеЗакрытиеОперДня</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_АдресБоевогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_БоевойСерверИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_БоевойСерверПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АдресТестовогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ТестовыйСерверИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ТестовыйСерверПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяШиротаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДолготаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяШиротаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДолготаЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ксАдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АккаунтБоевогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_АккаунтТестовогоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ИдРаспредЦентраБоевогоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vr_ИдРаспредЦентраТестовогоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаСтаршегоЛогиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечатиЧековРМЭкипажа</name>
    <type>
      <types>EnumRef.ВариантыПечатиЧековРМЭкипажа</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверККМ</name>
    <type>
      <types>ExchangePlanRef.ОбменСКассовымСервером</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_ОсновнойРаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаЦентраЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаЦентраЗоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаДоставкиВОбласти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаДоставкиВОбласти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/ПараметрыРегиональныхТерминалов/ПараметрыРегиональныхТерминалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыРегиональныхТерминалов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РежимНазначенияНомеровПалетПриМаршрутизации</name>
    <type>
      <types>EnumRef.РежимыНазначенияНомеровПалет</types>
    </type>
  </resources>
  <resources>
    <name>МетодикаЛогистическойМаршрутизации</name>
    <type>
      <types>EnumRef.МетодикаЛогистическойМаршрутизации</types>
    </type>
  </resources>
  <resources>
    <name>СхемаНазначенияНомеровПалетПоПолигонам</name>
    <type>
      <types>CatalogRef.СхемыНазначенияНомеровПалетПоПолигонам</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОпределениеСменыМаршрутизации</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>ЗонаТарификацииЗаказовСамовывоза</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </resources>
  <dimensions>
    <name>РегиональныйТерминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/РежимыНазначенияНомеровПалет/РежимыНазначенияНомеровПалет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыНазначенияНомеровПалет</name>
  <enumValues>
    <name>Случайно</name>
  </enumValues>
  <enumValues>
    <name>ПоВремениОкончанияРейса</name>
  </enumValues>
  <enumValues>
    <name>ПоМаркеТранспортаИПоВремениОкончанияРейса</name>
  </enumValues>
  <enumValues>
    <name>ПоМаркеТранспортаИПоВремениОкончанияРейсаПлюсПрефикс</name>
  </enumValues>
  <enumValues>
    <name>ПоМаркеТранспортаИНомеруПолигона</name>
  </enumValues>
  <enumValues>
    <name>ПоПрефиксуСмены</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/РегиональныеТерминалы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не РольДоступна("Админы") Тогда
		ТолькоПросмотр = Истина;
	КонецеСли;	
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЧтениеПараметровРегиональныхТерминалов();
КонецПроцедуры



&НаСервере
Процедура РедактироватьНастройкиРегламентногоЗадания()
	
	// ---------------  регламентное задание "ВыгрузкаМашинВАдминку"	
	мРегламентноеЗадание = Неопределено;
	ТекущееРегламентноеЗадание = НайтиРеглЗаданиеПоПараметру(Объект.РегламентноеЗадание);

	Если ЗначениеЗаполнено(мРегламентноеЗадание)  Тогда	
		ОбъектЗадания = ПолучитьИзВременногоХранилища(мРегламентноеЗадание);		
	Иначе	
		ОбъектЗадания = РегламентныеЗадания.СоздатьРегламентноеЗадание("ВыгрузкаМашинВАдминку");	
	    Объект.РегламентноеЗадание = ОбъектЗадания.УникальныйИдентификатор;
		ОбъектЗадания.Параметры.Добавить(Объект.Код);
	КонецЕсли;
	
	Если ОбъектЗадания = Неопределено Тогда		
		ОбъектЗадания = РегламентныеЗадания.СоздатьРегламентноеЗадание("ВыгрузкаМашинВАдминку");	
	    Объект.РегламентноеЗадание = ОбъектЗадания.УникальныйИдентификатор;
		ОбъектЗадания.Параметры.Добавить(Объект.Код);
	КонецЕсли;
								
	ОбъектЗадания.Наименование = "ВыгрузкаМашинВАдминку";
	ОбъектЗадания.Использование = Объект.Активен;
	ОбъектЗадания.Ключ = Объект.Код;	
	ОбъектЗадания.Расписание.ВремяНачала = Объект.ВремяВыгрузки;
	ОбъектЗадания.Расписание.ПериодПовтораДней = 1;

	Попытка	
		ОбъектЗадания.Записать();		   
	Исключение
		#Если Клиент Тогда
			Сообщить("Не удалось создать регламентное задание ""ВыгрузкаМашинВАдминку"". ");
		#КонецЕсли	
	КонецПопытки;
	
	// ---------------  регламентное задание "Закрытие опер дня"
	мРегламентноеЗадание = Неопределено;
	ТекущееРегламентноеЗадание = НайтиРеглЗаданиеПоПараметру(Объект.РеглЗаданиеЗакрытиеОперДня);

	Если ЗначениеЗаполнено(мРегламентноеЗадание)  Тогда	
		ОбъектЗадания = ПолучитьИзВременногоХранилища(мРегламентноеЗадание);		
	Иначе	
		ОбъектЗадания = РегламентныеЗадания.СоздатьРегламентноеЗадание("ЗакрытиеОперДня");	
	    Объект.РеглЗаданиеЗакрытиеОперДня = ОбъектЗадания.УникальныйИдентификатор;	
		ОбъектЗадания.Параметры.Добавить(Объект.Код);
	КонецЕсли;
	
	Если ОбъектЗадания = Неопределено Тогда		
		ОбъектЗадания = РегламентныеЗадания.СоздатьРегламентноеЗадание("ЗакрытиеОперДня");	
	    Объект.РеглЗаданиеЗакрытиеОперДня = ОбъектЗадания.УникальныйИдентификатор;
		ОбъектЗадания.Параметры.Добавить(Объект.Код);
	КонецЕсли;
								
	ОбъектЗадания.Наименование = "РегламентЗакрытиеОперДняСклад";
	ОбъектЗадания.Ключ = Объект.Код;	
	ОбъектЗадания.Использование = Объект.Активен;
	ОбъектЗадания.Расписание.ВремяНачала = Объект.ВремяЗакрытияОперДня;    
	ОбъектЗадания.Расписание.ПериодПовтораДней = 1;

	Попытка	
		ОбъектЗадания.Записать();		   
	Исключение
		#Если Клиент Тогда
			Сообщить("Не удалось создать регламентное задание ""РегламентЗакрытиеОперДняСклад"". ");
		#КонецЕсли	
	КонецПопытки;
	
		
КонецПроцедуры

&НаСервере
Функция НайтиРеглЗаданиеПоПараметру(УникальныйНомерЗадания)
	
	Попытка
		
		Если НЕ ПустаяСтрока(УникальныйНомерЗадания) Тогда
			
			УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор(УникальныйНомерЗадания);
			ТекущееРегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);
			
		Иначе
			
			ТекущееРегламентноеЗадание = Неопределено;
			
		КонецЕсли;
		
	Исключение
		
		ТекущееРегламентноеЗадание = Неопределено;
		
    КонецПопытки;
	
	мРегламентноеЗадание = ПоместитьВоВременноеХранилище(ТекущееРегламентноеЗадание);
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЧтениеПараметровРегиональныхТерминалов()

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПараметрыРегиональныхТерминаловСрезПоследних.Период КАК Период,
	                      |	ПараметрыРегиональныхТерминаловСрезПоследних.РегиональныйТерминал КАК РегиональныйТерминал,
	                      |	ПараметрыРегиональныхТерминаловСрезПоследних.РежимНазначенияНомеровПалетПриМаршрутизации КАК РежимНазначенияНомеровПалетПриМаршрутизации,
	                      |	ПараметрыРегиональныхТерминаловСрезПоследних.МетодикаЛогистическойМаршрутизации КАК МетодикаЛогистическойМаршрутизации,
	                      |	ПараметрыРегиональныхТерминаловСрезПоследних.СхемаНазначенияНомеровПалетПоПолигонам КАК СхемаНазначенияНомеровПалетПоПолигонам,
	                      |	ПараметрыРегиональныхТерминаловСрезПоследних.ИспользоватьОпределениеСменыМаршрутизации КАК ИспользоватьОпределениеСменыМаршрутизации,
						  |	ПараметрыРегиональныхТерминаловСрезПоследних.ЗонаТарификацииЗаказовСамовывоза КАК ЗонаТарификацииЗаказовСамовывоза
	                      |ИЗ
	                      |	РегистрСведений.ПараметрыРегиональныхТерминалов.СрезПоследних КАК ПараметрыРегиональныхТерминаловСрезПоследних
	                      |ГДЕ
	                      |	ПараметрыРегиональныхТерминаловСрезПоследних.РегиональныйТерминал = &РегиональныйТерминал");
	Запрос.УстановитьПараметр("РегиональныйТерминал", Объект.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда				
		РежимНазначенияНомеровПалетПриМаршрутизации = Рез.РежимНазначенияНомеровПалетПриМаршрутизации;
		МетодикаЛогистическойМаршрутизации = Рез.МетодикаЛогистическойМаршрутизации;	
		СхемаНазначенияНомеровПалетПоПолигонам = Рез.СхемаНазначенияНомеровПалетПоПолигонам;
		ИспользоватьОпределениеСменыМаршрутизации = Рез.ИспользоватьОпределениеСменыМаршрутизации;
		ЗонаТарификацииЗаказовСамовывоза = Рез.ЗонаТарификацииЗаказовСамовывоза;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаписьПараметровРегиональныхТерминалов()

	ТекВр = ТекущаяДата();
	
	Набор = РегистрыСведений.ПараметрыРегиональныхТерминалов.СоздатьНаборЗаписей();
	Набор.Отбор.РегиональныйТерминал.Установить(Объект.Ссылка);
	Набор.Прочитать();
	
	НЗапись = Набор.Добавить();
	НЗапись.Период = ТекВр;
	НЗапись.РегиональныйТерминал = Объект.Ссылка;
	НЗапись.МетодикаЛогистическойМаршрутизации = МетодикаЛогистическойМаршрутизации;
	НЗапись.РежимНазначенияНомеровПалетПриМаршрутизации = РежимНазначенияНомеровПалетПриМаршрутизации;
	НЗапись.СхемаНазначенияНомеровПалетПоПолигонам = СхемаНазначенияНомеровПалетПоПолигонам;
	НЗапись.ИспользоватьОпределениеСменыМаршрутизации = ИспользоватьОпределениеСменыМаршрутизации;
	НЗапись.ЗонаТарификацииЗаказовСамовывоза = ЗонаТарификацииЗаказовСамовывоза;
	
	Набор.Записать();	
	
	ДоступностьРедактированияСхемаНазначенияНомеровПалетПоПолигонам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	От = Вопрос("Изменить параметры регламентных заданий?", РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Нет);
	Если От = КодВозвратаДиалога.Да Тогда
		РедактироватьНастройкиРегламентногоЗадания();
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаписьПараметровРегиональныхТерминалов();
КонецПроцедуры

// Якурнов 21.08.2018 17:56:10
&НаСервере
Процедура ДоступностьРедактированияСхемаНазначенияНомеровПалетПоПолигонам()
	
	Если НЕ РежимНазначенияНомеровПалетПриМаршрутизации = Перечисления.РежимыНазначенияНомеровПалет.ПоМаркеТранспортаИНомеруПолигона Тогда
		Элементы.СхемаНазначенияНомеровПалетПоПолигонам.Доступность = Ложь;
	Иначе
		Элементы.СхемаНазначенияНомеровПалетПоПолигонам.Доступность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступностьРедактированияСхемаНазначенияНомеровПалетПоПолигонам();
КонецПроцедуры

&НаКлиенте
Процедура РежимНазначенияНомеровПалетПриМаршрутизацииПриИзменении(Элемент)
	ДоступностьРедактированияСхемаНазначенияНомеровПалетПоПолигонам();
КонецПроцедуры
